app/reflexes/example_reflex.rb

  def toggle
    todo = Todo.find(element.dataset[:id])
    todo.update(completed_at: (todo.completed_at? ? nil : Time.current))
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "completed_at" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed_at", nil], ["updated_at", "2022-06-09 10:38:49.225913"], ["id", 2]]