app/reflexes/message_reflex.rb

  def create
    @chat = Chat.new(chat_params)
    @chat.save
---
INSERT INTO "chats" ("message", "sender", "receiver", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["message", "TOP-GUN movie released"], ["sender", "Tom Cruise"], ["receiver", "Mongolia"], ["created_at", "2022-06-10 10:29:14.776504"], ["updated_at", "2022-06-10 10:29:14.776504"]]