app/controllers/chats_controller.rb

  def index
    @chats = Chat.all
---
SELECT "chats".* FROM "chats"

  def create
    @chat = Chat.new(chat_params)

    respond_to do |format|
      if @chat.save
---
INSERT INTO "chats" ("message", "sender", "receiver", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["message", "Hi Tamir"], ["sender", "Kim Yuna"], ["receiver", "Tamir"], ["created_at", "2022-06-10 06:45:43.524154"], ["updated_at", "2022-06-10 06:45:43.524154"]]

  def destroy
    @chat.destroy
---
DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 2]]

    def set_chat
      @chat = Chat.find(params[:id])
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]