app/controllers/todos_controller.rb

INSERT INTO "todos" ("description", "completed_at", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Stimulus Reflex learn"], ["completed_at", "2022-06-09 10:04:00"], ["created_at", "2022-06-09 10:04:59.142913"], ["updated_at", "2022-06-09 10:04:59.142913"]]
---
  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save